package com.example.news

data class NewsItem(val num: Int, val title: String, val image: Int, val detail: String)


object NewsListRepository {
    fun getNewsList() : List<NewsItem> {
        val dataList = mutableListOf<NewsItem>()

        dataList.add(
            NewsItem(
                1,
                "김하성, 이틀 연속 멀티히트 활약",
                R.drawable.sample1,
                "[스파르타뉴스 김스파 기자] 샌디에이고 파드리스 김하성이 연이틀 멀티히트 활약을 펼치면서 존재감을 나타냈다. 김하성은 31일(한국시간) 미국 미주리주 세인트루이스의 부시 스타디움에서 열린 2023 메이저리그(MLB) 세인트루이스 카디널스와의 원정경기에 1번타자 겸 2루수로 선발 출전, 4타수 2안타 1타점 1득점을 기록했다. 세인트루이스와의 3연전에서 3경기 연속 안타 및 2경기 연속 멀티히트 행진으로 쾌조의 타격감을 자랑한 김하성의 시즌 타율은 0.276에서 0.278로 상승했다."
            )
        )
        dataList.add(
            NewsItem(
                2,
                "최지만 공격적 영입",
                R.drawable.sample2,
                "[스파르타뉴스 이르타 기자] “엄청난 실망이다. 샌디에이고 파드레스가 트레이드 데드라인 직전에 파이어 세일을 해야 했을까. ESPN은 지난 30일(이하 한국시각) 메이저리그 30개 구단의 트레이드 마감일 이후 1달간의 행보를 돌아봤다. 샌디에이고를 두고 “엄청난 실망이다”라고 했다."
            )
        )
        dataList.add(
            NewsItem(
                3,
                "류현진, 4년 만의 4연승 도전",
                R.drawable.sample3,
                "[스파르타뉴스 김스파 기자] = 류현진(36·토론토 블루제이스)이 투수들의 무덤이자 타자들의 천국인 쿠어스 필드를 4년 만에 다시 찾는다. 미국프로야구 메이저리그(MLB) 토론토 블루제이스 구단은 미국 서부 원정 6연전으로 9월을 시작한다. 토론토는 9월 2일 오전 9시 40분(한국시간) 미국 콜로라도주 덴버의 쿠어스필드에서 열리는 콜로라도 로키스와의 원정 6연전 첫 경기 선발 투수로 류현진을 예고했다."
            )
        )
        dataList.add(
            NewsItem(
                4,
                "2년 연속 150안타' LAA 오타니 3연패 탈출",
                R.drawable.sample4,
                "[스파르타뉴스 이르타 기자] LA 에인절스 오타니 쇼헤이가 세 경기 연속 안타를 터뜨리며 좋은 흐름을 이어갔다. 다만 주루사를 기록하는 등 지옥과 천국을 왔다갔다 한 끝에 팀의 승리로 미소를 지을 수 있게 됐다. 오타니는 31일(이하 한국시각) 미국 펜실베이니아주 필라델피아의 시티즌스 뱅크 파크에서 열린 2023 메이저리그 필라델피아 필리스와 원정 맞대결에 3번, 지명타자로 선발 출전해 4타수 1안타 1타점 1득점 1볼넷을 기록했다."
            )
        )
        dataList.add(
            NewsItem(
                5,
                "하퍼, 개인 통산 '300홈런' 달성",
                R.drawable.sample5,
                "[스파르타뉴스 김스파 기자] = 필라델피아 필리스의 간판타자 브라이스 하퍼(30)가 개인 통산 300홈런 고지를 밟았다. 하퍼는 31일(한국시간) 미국 펜실베이니아주 필라델피아의 시티즌스뱅크파크에서 열린 2023 메이저리그(MLB) LA 에인절스와의 경기에 3번 타자 1루수로 선발 출전해 4타수 1안타 1홈런 2타점 1볼넷 활약을 펼쳤다."
            )
        )
        dataList.add(
            NewsItem(
                6,
                "샌디에이고 가을야구 ‘가물’",
                R.drawable.sample6,
                "[스파르타뉴스 이르타 기자] 샌디에이고 파드리스의 ‘엔진’ 김하성(28)이 2경기 연속 멀티 히트를 뿜었다. 하지만 샌디에이고는 이틀 연속 뼈아픈 끝내기 패배를 당하며 가을 야구에서 멀어지고 있다. 31일(한국 시간) 미국 미주리주 부시 스타디움에서 열린 미국프로야구 메이저리그(MLB) 세인트루이스 카디널스 원정에 1번 타자 2루수로 나선 김하성은 4타수 2안타 1타점 1득점으로 활약했다. 전날의 3타수 2안타 1타점 1득점을 더해 2경기에서 7타수 4안타다. 시즌 타율은 0.278."
            )
        )
        dataList.add(
            NewsItem(
                7,
                "시애틀 8월에만 21승, 월 최다승 신기록 작성",
                R.drawable.sample7,
                "[스파르타뉴스 김스파 기자] 시애틀 매리너스가 구단 월간 최다승 신기록을 달성했다. 올해 8월에만 무려 21승(6패)을 거두며 종전 기록(20승)을 경신했다. 시애틀은 30일(이하 현지 시각) 오클랜드 애슬레틱스와 홈 경기에서 5-4로 이겼다. 2회초 먼저 3실점하며 끌려갔으나 3회말 3점을 뽑아내며 승부를 원점으로 돌렸다. 7회초 다시 실점하며 뒤졌지만 7회말 2점을 얻으며 5-4로 역전승했다. 전날 패배를 설욕하고 승리하면서 76승 57패로 아메리칸리그 서부지구 선두를 지켰다."
            )
        )
        return dataList
    }

}